podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/MCM_MKE16F16.svd.xml
<!--
Devices using this peripheral: 
      MKE14F16
      MKE16F16
      MKE18F16
-->
      <peripheral>
         <?sourceFile "MCM_MKE16F16" ?>
         <name>MCM</name>
         <description>Core Platform Miscellaneous Control Module</description>
         <groupName>MCM</groupName>
         <headerStructName>MCM</headerStructName>
         <baseAddress>0xE0080000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "16" ?>
            <offset>0x8</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xC</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x20</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x30</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x40</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x400</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x480</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x488</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x490</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x4A0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PLASC</name>
               <description>Crossbar Switch (AXBS) Slave Configuration</description>
               <addressOffset>0x8</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x7</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>ASC</name>
                     <description>Each bit in the ASC field indicates whether there is a corresponding connection to the crossbar switch&apos;s slave input port</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>A bus slave connection to AXBS input port n is absent</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A bus slave connection to AXBS input port n is present</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLAMC</name>
               <description>Crossbar Switch (AXBS) Master Configuration</description>
               <addressOffset>0xA</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x7</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>AMC</name>
                     <description>Each bit in the AMC field indicates whether there is a corresponding connection to the AXBS master input port</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>A bus master connection to AXBS input port n is absent</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A bus master connection to AXBS input port n is present</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPCR</name>
               <description>Core Platform Control Register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>CBRR</name>
                     <description>Crossbar round-robin arbitration enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Fixed-priority arbitration</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Round-robin arbitration</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRAMUAP</name>
                     <description>SRAM_U arbitration priority</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Round robin</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Special round robin (favors SRAM backdoor accesses over the processor)</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Fixed priority. Processor has highest, backdoor has lowest</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Fixed priority. Backdoor has highest, processor has lowest</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRAMUWP</name>
                     <description>SRAM_U write protect</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field derivedFrom="SRAMUAP" > <name>SRAMLAP</name> <description>SRAM_L arbitration priority</description> <bitOffset>28</bitOffset> </field>
                  <field>
                     <name>SRAMLWP</name>
                     <description>SRAM_L Write Protect</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISCR</name>
               <description>Interrupt Status and Control Register</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>CWBER</name>
                     <description>Cache write buffer error status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Error occurred</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIOC</name>
                     <description>FPU invalid operation interrupt status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt occurred</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FIOC" > <name>FDZC</name> <description>FPU divide-by-zero interrupt status</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="FIOC" > <name>FOFC</name> <description>FPU overflow interrupt status</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="FIOC" > <name>FUFC</name> <description>FPU underflow interrupt status</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="FIOC" > <name>FIXC</name> <description>FPU inexact interrupt status</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="FIOC" > <name>FIDC</name> <description>FPU input denormal interrupt status</description> <bitOffset>15</bitOffset> </field>
                  <field>
                     <name>CWBEE</name>
                     <description>Cache write buffer error enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable error interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable error interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIOCE</name>
                     <description>FPU invalid operation interrupt enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FIOCE" > <name>FDZCE</name> <description>FPU divide-by-zero interrupt enable</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="FIOCE" > <name>FOFCE</name> <description>FPU overflow interrupt enable</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="FIOCE" > <name>FUFCE</name> <description>FPU underflow interrupt enable</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="FIOCE" > <name>FIXCE</name> <description>FPU inexact interrupt enable</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="FIOCE" > <name>FIDCE</name> <description>FPU input denormal interrupt enable</description> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>FADR</name>
               <description>Store Buffer Fault address register</description>
               <addressOffset>0x20</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>ADDRESS</name>
                     <description>Fault address</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>FATR</name>
               <description>Store Buffer Fault Attributes register</description>
               <addressOffset>0x24</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>BEDA</name>
                     <description>Bus Error Data Access type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Instruction</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Data</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BEMD</name>
                     <description>Bus error privilege level</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>User mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Supervisor/privileged mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BESZ</name>
                     <description>Bus error size</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>8-bit access</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>16-bit access</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>32-bit access</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BEWT</name>
                     <description>Bus error write</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Read access</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write access</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BEMN</name>
                     <description>Bus error master number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BEOVR</name>
                     <description>Bus error overrun</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No bus error overrun</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Bus error overrun occurred. The FADR and FDR registers and the other FATR bits are not updated to reflect this new bus error</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDR</name>
               <description>Store Buffer Fault Data Register</description>
               <addressOffset>0x28</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Fault data</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID</name>
               <description>Process ID register</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>PID</name>
                     <description>M0_PID And M1_PID For MPU</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPO</name>
               <description>Compute Operation Control Register</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>CPOREQ</name>
                     <description>Compute Operation request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Request is cleared</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Request Compute Operation</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CPOACK</name>
                     <description>Compute Operation acknowledge</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Compute operation entry has not completed or compute operation exit has completed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Compute operation entry has completed or compute operation exit has not completed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CPOWOI</name>
                     <description>Compute Operation wakeup on interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No effect</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>When set, the CPOREQ is cleared on any interrupt or exception vector fetch</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
